console.log("        *   * * *")
console.log("        *   *")
console.log("        *   * * *")
console.log("    *   *       *")
console.log("      * *   * * *")


const j = "Javascript"
const h = "HTML"
const c = "CSS"

console.log("Что такое " + j + " ?")
console.log("Что " + j + " делает?")
console.log( j + " это язык, который позволяет вам применять сложные вещи на web странице")
console.log("Необходимые навыки в " + j + " это " + h + " и " + c )
console.log(h + " - это язык разметки, который мы используем для визуального и смыслового структурирования нашего web контента.")
console.log(c + " - это язык стилей с помощью которого мы придаём стиль отображения нашего HTML контента")
console.log("Когда вы загружаете страничку в браузере, вы запускаете ваш код " + h + ", " + c + " и " + j)
console.log("Код " + j + " выполняется " + j +" -движком браузера, после того как код " + h +" и " + c +" был обработан и сформирован в веб-страницу.")